## 🏗️ Plan

### `plan-terraform/vpc`

### 1️⃣ Initialize
✅ **Pass**

<details>
<summary>show details</summary>

```

Initializing the backend...

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)

Providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://opentofu.org/docs/cli/plugins/signing/

OpenTofu has been successfully initialized!

You may now begin working with OpenTofu. Try running "tofu plan" to see
any changes that are required for your infrastructure. All OpenTofu commands
should now work.

If you ever set or change modules or backend configuration for OpenTofu,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```
</details>

### 2️⃣ Validate
✅ **Configuration is valid**

<details>
<summary>show details</summary>

```
Success! The configuration is valid.

```
</details>

### 3️⃣ Plan

<details>
<summary>show details</summary>

```diff

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_eip.nat will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-nat-eip"
          + "Project"     = "iac-ci-claw-test"
        }
      + tags_all             = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-nat-eip"
          + "Project"     = "iac-ci-claw-test"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-igw"
          + "Project"     = "iac-ci-claw-test"
        }
      + tags_all = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-igw"
          + "Project"     = "iac-ci-claw-test"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-nat-gw"
          + "Project"     = "iac-ci-claw-test"
        }
      + tags_all                           = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-nat-gw"
          + "Project"     = "iac-ci-claw-test"
        }
    }

  # aws_route.private_nat will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_internet will be created
  + resource "aws_route" "public_internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-private-rt"
          + "Project"     = "iac-ci-claw-test"
        }
      + tags_all         = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-private-rt"
          + "Project"     = "iac-ci-claw-test"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-public-rt"
          + "Project"     = "iac-ci-claw-test"
        }
      + tags_all         = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-public-rt"
          + "Project"     = "iac-ci-claw-test"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-private-us-west-2a"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-private-us-west-2a"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-private-us-west-2b"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-private-us-west-2b"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-public-us-west-2a"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "public"
        }
      + tags_all                                       = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-public-us-west-2a"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-public-us-west-2b"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "public"
        }
      + tags_all                                       = {
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-public-us-west-2b"
          + "Project"     = "iac-ci-claw-test"
          + "Tier"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Description" = "Main VPC for iac-ci-claw-test"
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-vpc"
          + "Project"     = "iac-ci-claw-test"
        }
      + tags_all                             = {
          + "Description" = "Main VPC for iac-ci-claw-test"
          + "Environment" = "test"
          + "Name"        = "iac-ci-claw-test-vpc"
          + "Project"     = "iac-ci-claw-test"
        }
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    tofu apply "plan.out"

```

**📊 Plan Summary:**
- 🟢 **16 to add**
- 🟠 **0 to change**
- 🔴 **0 to destroy**
</details>

### 4️⃣ Security Scan
🔴 2 HIGH, 🟠 1 MEDIUM

<details>
<summary>show details</summary>

```

Results #1-2 HIGH Subnet associates public IP address. (2 similar results)
────────────────────────────────────────────────────────────────────────────────
  main.tf:58
────────────────────────────────────────────────────────────────────────────────
   52    resource "aws_subnet" "public" {
   ..  
   58  [   map_public_ip_on_launch = true (true)
   ..  
   64    }
────────────────────────────────────────────────────────────────────────────────
  Individual Causes
  - main.tf:52-64 (aws_subnet.public[0])
  - main.tf:52-64 (aws_subnet.public[1])
────────────────────────────────────────────────────────────────────────────────
          ID aws-ec2-no-public-ip-subnet
      Impact The instance is publicly accessible
  Resolution Set the instance to not be publicly accessible

  More Information
  - https://aquasecurity.github.io/tfsec/v1.28.10/checks/aws/ec2/no-public-ip-subnet/
  - https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/subnet#map_public_ip_on_launch
────────────────────────────────────────────────────────────────────────────────


Result #3 MEDIUM VPC Flow Logs is not enabled for VPC  
────────────────────────────────────────────────────────────────────────────────
  main.tf:25-34
────────────────────────────────────────────────────────────────────────────────
   25    resource "aws_vpc" "this" {
   26      cidr_block           = var.vpc_cidr
   27      enable_dns_support   = true
   28      enable_dns_hostnames = true
   29    
   30      tags = merge(local.common_tags, {
   31        Name        = "${var.project_name}-vpc"
   32        Description = "Main VPC for iac-ci-claw-test"
   33      })
   34    }
────────────────────────────────────────────────────────────────────────────────
          ID aws-ec2-require-vpc-flow-logs-for-all-vpcs
      Impact Without VPC flow logs, you risk not having enough information about network traffic flow to investigate incidents or identify security issues.
  Resolution Enable flow logs for VPC

  More Information
  - https://aquasecurity.github.io/tfsec/v1.28.10/checks/aws/ec2/require-vpc-flow-logs-for-all-vpcs/
────────────────────────────────────────────────────────────────────────────────


  timings
  ──────────────────────────────────────────
  disk i/o             44.641µs
  parsing              3.072074ms
  adaptation           75.93µs
  checks               14.274859ms
  total                17.467504ms

  counts
  ──────────────────────────────────────────
  modules downloaded   0
  modules processed    1
  blocks processed     23
  files read           3

  results
  ──────────────────────────────────────────
  passed               2
  ignored              0
  critical             0
  high                 2
  medium               1
  low                  0

  2 passed, 3 potential problem(s) detected.


```
</details>

### 5️⃣ Cost Analysis
💰 **$0/mo**

<details>
<summary>show details</summary>

```
Project: .
Module path: .

Errors:
  Error sending API request:
    Post "https://pricing.api.infracost.io/graphql":
      POST https://pricing.api.infracost.io/graphql giving up after 1 attempt(s):
        Post "https://pricing.api.infracost.io/graphql":
          net/http:
            invalid header field value for "X-Api-Key"

 OVERALL TOTAL       $0.00 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
No cloud resources were detected

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ .                                                  ┃         $0.00 ┃           - ┃      $0.00 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛

```
</details>
---

## CI Details
+ ✅ SUCCESS


iac-ci:::tag::4dd6a346666614a95e690a02458029ff